In [7]:
import pandas as pd
data_frame = pd.read_csv('data.csv',encoding='utf-8')
df1 = pd.DataFrame(data_frame,columns=['Name','Wage','Value'])
df1

                     Name   Wage    Value
0                L. Messi  €565K  €110.5M
1       Cristiano Ronaldo  €405K     €77M
2               Neymar Jr  €290K  €118.5M
3                  De Gea  €260K     €72M
4            K. De Bruyne  €355K    €102M
...                   ...    ...      ...
18202        J. Lundstram    €1K     €60K
18203  N. Christoffersson    €1K     €60K
18204           B. Worman    €1K     €60K
18205      D. Walker-Rice    €1K     €60K
18206           G. Nugent    €1K     €60K

[18207 rows x 3 columns]

In [10]:
import pandas as pd
data_frame = pd.read_csv('data.csv',encoding='utf-8')
df1 = pd.DataFrame(data_frame,columns=['Name','Wage','Value'])
def value_to_float(x):
    if type(x) == float or type(x) == int:
        return x
    if 'K' in x:
        if len(x) > 1:
            return float(x.replace('K', '')) * 1000
        return 1000.0
    if 'M' in x:
        if len(x) > 1:
            return float(x.replace('M', '')) * 1000000
        return 1000000.0
    if 'B' in x:
        return float(x.replace('B', '')) * 1000000000
    return 0.0
value = df1['Value'].replace('[\€]','',regex=True).apply(value_to_float)
wage = df1['Wage'].replace('[\€]','',regex=True).apply(value_to_float)

df1['Value'] = value
df1['Wage'] = wage
df1['difference'] = df1['Value'] - df1['Wage']
df1.sort_values('difference',ascending=False)

               Name      Wage        Value   difference
2         Neymar Jr  290000.0  118500000.0  118210000.0
0          L. Messi  565000.0  110500000.0  109935000.0
4      K. De Bruyne  355000.0  102000000.0  101645000.0
5         E. Hazard  340000.0   93000000.0   92660000.0
15        P. Dybala  205000.0   89000000.0   88795000.0
...             ...       ...          ...          ...
17752   S. Phillips    1000.0          0.0      -1000.0
12192  H. Sulaimani    3000.0          0.0      -3000.0
3550    S. Nakamura    4000.0          0.0      -4000.0
4228       B. Nivet    5000.0          0.0      -5000.0
864          Hilton   18000.0          0.0     -18000.0

[18207 rows x 4 columns]